# Pandas

Pandas is a powerful library for data manipulation and analysis in Python. It is widely used in a range of fields, including data science, finance, and statistics.

## 001. DataFrame Importing / Exporting

## 001.000 Assets

Some assets to avoid too much typing

| Name        | Age|
|-------------|----|
| Mbappé      | 23 |
| De Bruyne   | 31 |
| Lewandowski | 33 |
| Benzema     | 34 |
| Messi       | 35 |

In [1]:
import sys
from pathlib import Path

current_dir = Path().resolve()
while current_dir != current_dir.parent and current_dir.name != "katas":
    current_dir = current_dir.parent
if current_dir != current_dir.parent:
    sys.path.append(current_dir.as_posix())

In [2]:
import pandas as pd
import numpy as np
from lib.utils import fresh_df
from IPython.core.interactiveshell import InteractiveShell

pd.set_option('display.max_rows', None)
InteractiveShell.ast_node_interactivity = "all"
names_as_list = ["Mbappé", "De Bruyne", "Lewandowski", "Benzema", "Messi"]
ages_as_list = [ 23,       31,          33,             34,        35]

### 001.001 Dictionary of arrays

1. Replicate this data as a dataframe with a dictionary of arrays, using a constructor, and print it
1. Do the same, but using from_dict
1. Extract the dict out of the df again with to_dict

In [3]:
# solution
1
data = {
    "Name": names_as_list,
    "Age": ages_as_list
}
pd.DataFrame(data)

2
df = pd.DataFrame.from_dict(data)
df

3
df.to_dict(orient="list")

1

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

{'Name': ['Mbappé', 'De Bruyne', 'Lewandowski', 'Benzema', 'Messi'],
 'Age': [23, 31, 33, 34, 35]}

### 001.002 List of dictionaries

1. Create a list where every entry is a dict with keys "Name" and "Age", and print
1. Create a df from it
1. Do the same, but using from_records
1. Extract the list out of the df again with to_dict (not to_records). Note that you can actually get a list and not a dict, with the right parameters...

In [4]:
# solution
1
data = [{ "Name": name, "Age": age} for name, age in zip(names_as_list, ages_as_list)]
data
pd.DataFrame(data)

2
df = pd.DataFrame.from_records(data)
df

3
df.to_dict(orient="records")

1

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

3

[{'Name': 'Mbappé', 'Age': 23},
 {'Name': 'De Bruyne', 'Age': 31},
 {'Name': 'Lewandowski', 'Age': 33},
 {'Name': 'Benzema', 'Age': 34},
 {'Name': 'Messi', 'Age': 35}]

### 001.003 2D NumPy array

1. Print a NumPy 2D array with the same data as before, but with an extra column for "Last Updated" with a pd.Timestamp, and create a df with it. Make sure the column names are still "Name", "Age", "Last Updated"
1. Update the "Last Updated" column with the current timestamp
1. Convert to a NumPy and print it, proving the timestamp is different

In [5]:
# solution

1
data = np.array([ [name, age, pd.Timestamp.now()] for name, age in zip(names_as_list, ages_as_list)])
data
df = pd.DataFrame(data, columns=["Name", "Age", "Last Updated"])
df

2
df["Last Updated"] = pd.Timestamp.now()

3
data = df.to_numpy()
data

1

array([['Mbappé', 23, Timestamp('2023-03-21 23:06:10.366042')],
       ['De Bruyne', 31, Timestamp('2023-03-21 23:06:10.367419')],
       ['Lewandowski', 33, Timestamp('2023-03-21 23:06:10.367427')],
       ['Benzema', 34, Timestamp('2023-03-21 23:06:10.367429')],
       ['Messi', 35, Timestamp('2023-03-21 23:06:10.367430')]],
      dtype=object)

          Name Age               Last Updated
0       Mbappé  23 2023-03-21 23:06:10.366042
1    De Bruyne  31 2023-03-21 23:06:10.367419
2  Lewandowski  33 2023-03-21 23:06:10.367427
3      Benzema  34 2023-03-21 23:06:10.367429
4        Messi  35 2023-03-21 23:06:10.367430

2

3

array([['Mbappé', 23, Timestamp('2023-03-21 23:06:10.373955')],
       ['De Bruyne', 31, Timestamp('2023-03-21 23:06:10.373955')],
       ['Lewandowski', 33, Timestamp('2023-03-21 23:06:10.373955')],
       ['Benzema', 34, Timestamp('2023-03-21 23:06:10.373955')],
       ['Messi', 35, Timestamp('2023-03-21 23:06:10.373955')]],
      dtype=object)

### 001.004 Pandas Series

1. Create two pandas series from the two lists, and then concatenate them into a df. Make sure the column names are still "Name" and "Age"
1. Do the same thing, but differently - this time mae sure the names are already in the Series

In [13]:
# solution
1
s1 = pd.Series(names_as_list)
s2 = pd.Series(ages_as_list)
pd.concat([s1, s2], keys=["Name", "Age"], axis=1)

2
s1 = pd.Series(names_as_list, name="Name")
s2 = pd.Series(ages_as_list, name="Age")
pd.concat([s1, s2], axis=1)

1

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

2

          Name  Age
0       Mbappé   23
1    De Bruyne   31
2  Lewandowski   33
3      Benzema   34
4        Messi   35

### 001.005 SQL (sqlite)

1. Create a DataFrame by reading from table 'players' in SQLite DB "001.005.sqlite" with the built-in SQLite module. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the database. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [7]:
# solution
import sqlite3 as sqlite

1
con = sqlite.connect("001.005.sqlite")
df = pd.read_sql("SELECT * FROM players", con=con, index_col="id")
df

2
df["Last Updated"] = pd.Timestamp.now()
df.to_sql("players", con=con, if_exists="replace", index=True, index_label="id")

3
pd.read_sql("SELECT * FROM players", con=con, index_col="id")

1

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-30 22:14:49.275438
1     De Bruyne   31  2023-01-30 22:14:49.275438
2   Lewandowski   33  2023-01-30 22:14:49.275438
3       Benzema   34  2023-01-30 22:14:49.275438
4         Messi   35  2023-01-30 22:14:49.275438

2

5

3

           Name  Age                Last Updated
id
0        Mbappé   23  2023-03-21 23:06:10.431309
1     De Bruyne   31  2023-03-21 23:06:10.431309
2   Lewandowski   33  2023-03-21 23:06:10.431309
3       Benzema   34  2023-03-21 23:06:10.431309
4         Messi   35  2023-03-21 23:06:10.431309

### 001.006 SQL (sqlalchemy)

1. Replicate 001.005 but use sqlalchemy to connect to the DB

(Note: you will probably get warnings, but you can ignore them)

In [8]:
# solution
from sqlalchemy import create_engine

engine = create_engine(f"sqlite:///001.005.sqlite")
conn = engine.raw_connection()
df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')
df.head()

df["Last Updated"] = pd.Timestamp.now()
df.to_sql('players', con=conn, if_exists='replace', index=True, index_label='id')

df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')
df.head()

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_77511/2142327572.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')

           Name  Age                Last Updated
id
0        Mbappé   23  2023-03-21 23:06:10.431309
1     De Bruyne   31  2023-03-21 23:06:10.431309
2   Lewandowski   33  2023-03-21 23:06:10.431309
3       Benzema   34  2023-03-21 23:06:10.431309
4         Messi   35  2023-03-21 23:06:10.431309

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_77511/2142327572.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df.to_sql('players', con=conn, if_exists='replace', index=True, index_label='id')

5

/var/folders/xx/dkxnk6_906gd2s414jw_d4m80000gn/T/ipykernel_77511/2142327572.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM players', conn, index_col='id')

           Name  Age                Last Updated
id
0        Mbappé   23  2023-03-21 23:06:10.611184
1     De Bruyne   31  2023-03-21 23:06:10.611184
2   Lewandowski   33  2023-03-21 23:06:10.611184
3       Benzema   34  2023-03-21 23:06:10.611184
4         Messi   35  2023-03-21 23:06:10.611184

### 001.007 TSV file

1. Create a DataFrame by reading from TSV file in `data_file`. Note that the index column is called 'id'
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [9]:
data_file = "001.007.tsv"
# solution

1
df = pd.read_csv(data_file, sep="\t", index_col="id")
df

2
df["Last Updated"] = pd.Timestamp.now()
df.to_csv(data_file, index=True, index_label="id", sep="\t")

3
pd.read_csv(data_file, sep="\t", index_col="id")

1

           Name  Age                Last Updated
id
0        Mbappé   23  2023-01-30 22:14:49.307813
1     De Bruyne   31  2023-01-30 22:14:49.307813
2   Lewandowski   33  2023-01-30 22:14:49.307813
3       Benzema   34  2023-01-30 22:14:49.307813
4         Messi   35  2023-01-30 22:14:49.307813

2

3

           Name  Age                Last Updated
id
0        Mbappé   23  2023-03-21 23:06:10.641710
1     De Bruyne   31  2023-03-21 23:06:10.641710
2   Lewandowski   33  2023-03-21 23:06:10.641710
3       Benzema   34  2023-03-21 23:06:10.641710
4         Messi   35  2023-03-21 23:06:10.641710

### 001.008 JSON file

1. Create a DataFrame by reading from JSON file in `data_file`
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you tell the function to use the 'id' column for indices
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp. Make sure non ASCII characters are readable

In [10]:
data_file = "001.008.json"
# solution

1
df = pd.read_json(data_file)
df

2
df["Last Updated"] = pd.Timestamp.now()
df.to_json(data_file, force_ascii=False)

3
pd.read_json(data_file)

1

          Name  Age   Last Updated
0       Mbappé   23  1675116889360
1    De Bruyne   31  1675116889360
2  Lewandowski   33  1675116889360
3      Benzema   34  1675116889360
4        Messi   35  1675116889360

2

3

          Name  Age   Last Updated
0       Mbappé   23  1679439970675
1    De Bruyne   31  1679439970675
2  Lewandowski   33  1679439970675
3      Benzema   34  1679439970675
4        Messi   35  1679439970675

### 001.009 From a table in an HTML page

1. Create a DataFrame by reading from HTML file in `data_file`. Use beautifulsoup flavor. Note that the column ID is called "ID"
1. Change the Last Updated column to the current timestamp in the DataFrame. Write the updated DataFrame data to the same file. HINT: Make sure you "flatten" the indices, because `to_html` writes two rows for the headers exactly as you see in the output
1. Load the data again in a new DataFrame, and confirm it's same as for step (1) except for the timestamp

In [11]:
data_file = "001.009.html"
# solution

1
df = pd.read_html(data_file, flavor="bs4", index_col="ID")[0]
df

2
df["Last Updated"] = pd.Timestamp.now()
df.columns.name = "ID"
df.index.name = None
df.to_html(data_file, index=True, header=["ID", "Name", "Age", "Last Updated"])

3
pd.read_html(data_file, flavor="bs4", index_col="ID")[0]

1

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-01-30 22:14:49.414680
1     De Bruyne   31  2023-01-30 22:14:49.414680
2   Lewandowski   33  2023-01-30 22:14:49.414680
3       Benzema   34  2023-01-30 22:14:49.414680
4         Messi   35  2023-01-30 22:14:49.414680

2

3

           Name  Age                Last Updated
ID
0        Mbappé   23  2023-03-21 23:06:10.823054
1     De Bruyne   31  2023-03-21 23:06:10.823054
2   Lewandowski   33  2023-03-21 23:06:10.823054
3       Benzema   34  2023-03-21 23:06:10.823054
4         Messi   35  2023-03-21 23:06:10.823054

### 001.010 Markdown

(requires the tabulate package)

1. There is no read_markdown method. Use the generic method to load tabular data, making sure that
   1. It is aware of | as delimiter
   1. It handles the index as the 1st (zero-based) column
   1. It treates the 1st and last delimiters as _separators_, meaning it puts an empty column either side. Remove them
   1. It treats the `------` row as a normal data row. Remove it
1. There is a to_markdown, method, but it doesn't write to a file like the similarly named ones. You'll have to do it old-school
   1. Overwrite `Last Updated` with the current timestamp
   1. Write a file using the output of to_markdown, using the 'github' table format
1. Reload the table again and prove it was overwritten correctly

In [12]:
data_file = "001.010.md"
# solution

1
df = pd.read_table(
    filepath_or_buffer=data_file, sep="|", index_col=1
    ).dropna(axis=1, how='all').iloc[1:]  
df.columns = df.columns.str.strip() 
df

2
df["Last Updated"] = pd.Timestamp.now()
with open(data_file, "w") as f:
    f.write(df.to_markdown(tablefmt="github"))
    

3
pd.read_table(filepath_or_buffer=data_file, sep="|", header=0, index_col=1, skipinitialspace=True).dropna(axis=1, how='all').iloc[1:]  
df.columns = df.columns.str.strip()

1

                            Name          Age                  Last Updated
         id
          0         Mbappé           23         2023-01-30 23:36:27.307636
          1         De Bruyne        31         2023-01-30 23:36:27.307636
          2         Lewandowski      33         2023-01-30 23:36:27.307636
          3         Benzema          34         2023-01-30 23:36:27.307636
          4         Messi            35         2023-01-30 23:36:27.307636

2

566

3

           Name               Age   Last Updated
id
0          Mbappé        23         2023-03-21 23:06:10.854100
1          De Bruyne     31         2023-03-21 23:06:10.854100
2          Lewandowski   33         2023-03-21 23:06:10.854100
3          Benzema       34         2023-03-21 23:06:10.854100
4          Messi         35         2023-03-21 23:06:10.854100